import { QuestionData } from "../components/Question";

export const test: QuestionData[] = [
  {
    text: "Какой ваш любимый месяц года?",
    variants: [
      "Январь",
      "Февраль",
      "Март",
      "Апрель",
      "Май",
      "Июнь",
      "Июль",
      "Август",
      "Сентябрь",
      "Октябрь",
      "Ноябрь",
      "Декабрь",
    ],
  },
  {
    text: "Какой фильм вы бы предпочли посмотреть?",
    variants: ["Комедия", "Мелодрама", "Драма", "Боевик", "Триллер"],
  },
  {
    text: "Какой музыкальный жанр вам больше всего нравится?",
    variants: ["Рок", "Попса", "Электронная", "Кантри", "Джаз"],
  },
  {
    text: "Какой тип погоды вы предпочитаете?",
    variants: ["Солнечная", "Облачная", "Дождливая", "Снежная", "Ветреная"],
  },
  {
    text: "Каким видом спорта вы занимаетесь?",
    variants: ["Бег", "Фитнес", "Йога", "Плавание", "Боевые искусства"],
  },
  {
    text: "Какой стиль интерьера вы предпочитаете?",
    variants: ["Современный", "Классический", "Минимализм", "Лофт", "Прованс"],
  },
  {
    text: "Какой у вас любимый цветок?",
    variants: ["Роза", "Тюльпан", "Орхидея", "Нарцисс", "Ромашка"],
  },
  {
    text: "Какое блюдо вы любите готовить?",
    variants: ["Суп", "Второе блюдо", "Десерт", "Закуска", "Не люблю готовить"],
  },
  {
    text: "Какой напиток вы предпочитаете?",
    variants: ["Кофе", "Чай", "Газировка", "Сок"],
  },
  {
    text: "Какую страну вы хотели бы посетить?",
    variants: ["Франция", "Испания", "Италия", "Греция", "Англия", "США", "Грузия"],
  },
];
